{
  "PM": "Hello everyone. Today's topic is \"Homework should be abolished\". We have two points: The first point is \"free time\" and the second point is \"decrease burden on teachers\". I will explain the first point of \"free time\". We believe that if homework were to be abolished, we could have more free time. As a result, we could do more of what we really wanted like club activities, hobbies, or playing with friends. In my case, I go to tennis club after class until 5:00 pm and then I go to cram school until 8:00 pm. After this full day, I arrive at my home around 8:40 pm to eat dinner and take a shower. At nearly 10:00 pm I start my homework. I have a lot of homework. As a result, I go to bed late at night at nearly 1:00 am in the morning and I don't have the opportunity to sleep for a long period of time. It is not healthy. Therefore, homework should be abolished. Thank you.",
  "LO": "They said that because homework interferes with free time, it should be abolished. However, this argument assumes that students will put their free time to good use when they are not obligated to do any homework after school. However, not all kids have the self-discipline or good judgment to choose productive, wholesome activities to fill their time after school. By assigning work to be done after school, teachers are not only giving kids the chance to develop the good judgment and self-discipline needed to prioritize homework, they are also helping keep kids out of trouble. Homework serves as an activity that occupies the child's time with something useful -- education -- instead of something potentially harmful (such as chatting with strangers online or experimenting with drugs), or at the least, something that is mostly a waste of time (such as playing video games or watching TV).",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "suppresses",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "is more important/severe/has greater weight than",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "X",
            "is more important/severe/has greater weight than",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ],
      "acknowledges",
      [
        [
          "X",
          "suppresses",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ],
      "but nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "Homework",
      "Y": "free time",
      "A": "By assigning work to be done after school, teachers are not only giving kids the chance to develop the good judgment and self-discipline needed to prioritize homework, they are also helping keep kids out of trouble"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      42
    ],
    "Y": [
      105,
      114
    ],
    "A": [
      366,
      580
    ]
  }
}