{
  "PM": "Hello everyone. Today, we are given the motion that homework should be abolished. We defined that homework for primary students should be abolished. We have two points: First, some students tend to dislike studying. Secondly, we have more effective learning ways than homework. Let me explain our first argument. Some students tend to dislike studying but are obliged to do homework and most of students are not enthusiastic about homework. Studying, in fact, is not something to be obliged but rather for satisfying intellectual curiosity. Imagine one-year old babies. They are always looking around, crawling from corner to corner, and touching, even biting, everything unfamiliar to them. In this way, they learn new things and expand their understanding of the world. That's how studying should be. It's not good for students to be obliged to study by their teachers or parents. Being obliged will lead to problems between family. That's one of the reasons some students tend to dislike studying. That is why homework should be abolished. Thank you.",
  "LO": "They said that students tend to dislike studying due to homework . However, it's not true. Because by doing homework, students can find studying interesting because homework is a tool of review or preparation for classes. Thanks to homework, they can understand the contents and this understanding facilitate finding it interesting. If they can't understand classes due to decrease opportunities of reviewing at home. That's why rather under the their side, students tend to dislike studying because they have difficulty catching up with classes. So, homework is important to participate and enjoy classes.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "no X",
          "suppresses",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "no X",
            "promotes",
            "A"
          ],
          [
            "A",
            "is bad"
          ]
        ],
        [
          [
            "A",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "no X",
            "promotes",
            "A"
          ],
          [
            "A",
            "is bad"
          ]
        ],
        [
          [
            "A",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ]
      ],
      "nullify",
      [
        [
          "no X",
          "suppresses",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "Text spans": {
      "X": "homework",
      "Y": "dislike studying",
      "A": "can’t understand classes due to decrease opportunities of reviewing at home"
    }
  },
  "Character offset of text spans": {
    "X": [
      52,
      60
    ],
    "Y": [
      198,
      214
    ],
    "A": [
      341,
      416
    ]
  }
}