{
  "PM": "Hello everyone. Today's topic is \"Homework should be abolished\". I am going to make two arguments: First, forcing students to do homework will make them passive in character, rather than active. Secondly, abolishing assignments can reduce teachers' workloads. Let me start with the first argument. Some people may think that students should be given homework so that they can learn what to do. However, this is harmful to students because a school is not a place where students only learn to study. It is also where they learn how to live and manage their own lives. Once they graduate from school and start a career, they no longer have a \"teacher\" who will always take care of them and manage what they need to do. Students will have to think about what they need to do by themselves. If students are always given homework, they will always be waiting for instructions and guidelines from teachers and cannot think about what they need to do by themselves. In order to avoid this, homework should be abolished so that students can study on their own initiative. Therefore, for these reasons, homework should be abolished. Thank you.",
  "LO": "\"They said that homework should be abolished. However, homework should not be abolished. Homework serves a valuable purpose. Homework does not make students passive in character, but instead strengthens their work ethic and reinforces that learning is an ongoing process that doesn't simply end as soon as one leaves the classroom. Homework keeps students and their minds continually engaged with the learning material even after they physically leave school for the day. Homework is completed on a student's own time and schedule which helps them learn and improve on their time management skills. The idea that homework will somehow make students weak, passive, and overly dependent on teachers is illogical nonsense. Further, if a teacher's workload is too high, it is unlikely that homework is the cause.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "doesn't promote",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "X",
            "doesn't promote",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ],
      "nullify",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "Text spans": {
      "X": "Homework",
      "Y": "make them passive in character, rather than active",
      "A": "Homework is completed on a student's own time and schedule which helps them learn and improve on their time management skills"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      42
    ],
    "Y": [
      143,
      193
    ],
    "A": [
      472,
      597
    ]
  }
}