{
  "PM": "Hello everyone. Today's topic is \"Homework should be abolished\". I am going to make two arguments: First, forcing students to do homework will make them passive in character, rather than active. Secondly, abolishing assignments can reduce teachers' workloads. Let me start with the first argument. Some people may think that students should be given homework so that they can learn what to do. However, this is harmful to students because a school is not a place where students only learn to study. It is also where they learn how to live and manage their own lives. Once they graduate from school and start a career, they no longer have a \"teacher\" who will always take care of them and manage what they need to do. Students will have to think about what they need to do by themselves. If students are always given homework, they will always be waiting for instructions and guidelines from teachers and cannot think about what they need to do by themselves. In order to avoid this, homework should be abolished so that students can study on their own initiative. Therefore, for these reasons, homework should be abolished. Thank you.",
  "LO": "They said that homework makes students passive. However, their assumption isn't true. Their assumption is here; under their side, they can make students active. However, anyway children don't become active. Because children don't have incentive to study voluntarily. That's because compared to studying, playing game or reading manga is more interesting for children. Moreover, since children is immature and less likely to think long-termly,  children unlikely to know the importance of studying. That's why even without homework, children can't actively study by themselves. So, their claim is symmetrical.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "no X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "no X",
            "doesn't promote",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "no X",
            "doesn't promote",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ],
      "nullify",
      [
        [
          "no X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "Text spans": {
      "X": "Homework",
      "Y": "students can study on their own initiative",
      "A": "children don't have incentive to study voluntarily"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      42
    ],
    "Y": [
      1020,
      1062
    ],
    "A": [
      215,
      265
    ]
  }
}