{
  "PM": "Hello everyone. Today's topic is \"Homework should be abolished\". We have two points: The first point is \"free time\" and the second point is \"decrease burden on teachers\". I will explain the first point of \"free time\". We believe that if homework were to be abolished, we could have more free time. As a result, we could do more of what we really wanted like club activities, hobbies, or playing with friends. In my case, I go to tennis club after class until 5:00 pm and then I go to cram school until 8:00 pm. After this full day, I arrive at my home around 8:40 pm to eat dinner and take a shower. At nearly 10:00 pm I start my homework. I have a lot of homework. As a result, I go to bed late at night at nearly 1:00 am in the morning and I don't have the opportunity to sleep for a long period of time. It is not healthy. Therefore, homework should be abolished. Thank you.",
  "LO": "They said that if homework would be abolished, we could more free time. However, it is not important, in particular, to students. Because, not all students spend their free time wisely. It is supposed that most of students waste time in vain. As government team speaker said students are very busy because of club activities ,cram school and so on. Students are very tired, so they tend to play or something in free time. for example, net surfing, playing video games, and so on. As a result, most of students are lack of sleep because of meaningless things.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "suppresses",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "is more important/severe/has greater weight than",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "X",
            "is more important/severe/has greater weight than",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ],
      "acknowledges",
      [
        [
          "X",
          "suppresses",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ],
      "but nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "Homework",
      "Y": "free time",
      "A": "not all students spend their free time wisely"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      42
    ],
    "Y": [
      105,
      114
    ],
    "A": [
      139,
      184
    ]
  }
}