{
  "PM": "Hello everyone. Today, we are given the motion that homework should be abolished. We strongly support this motion. Before explaining our arguments, let me define the motion. We are going to talk about homework in every school in Japan. We have two points in our argument. The first point is \"harmful efforts\" and the second point is \"decreasing teacher's burden\". Let me explain our first argument. Our claim is that homework has harmful efforts on educational development of school students. Some students have memorized the incorrect way to study with homework. I'll give you some examples. In high school, students have lots of things to do, like hobbies, club activities, part-time jobs and so on. So how do students who have little time to do homework deal with it Some of them do homework during class, which is inefficient not only with regard to the homework but also to the class. In a worst-case scenario, they copy it from their classmates. Of course, it means that they would learn nothing. But they receive a passing score as long as they finish homework without understanding how to properly study. Who thinks homework works adequately in these situations We should abolish homework in order to let students understand the right and wrong ways to study. For all these reasons, we strongly support the motion. Thank you.",
  "LO": "They said that just finishing homework without understanding is harmful. However, it is not always true. Of course best case of homework is not just finishing, but as one of step, finishing itself can be benefits for students. For example, through copying answer from their classmates, they can see the details of answer, or how to solve the questions. In government paradigm, those opportunities are also deprived at the same time. In order to touch substance of study, just finishing homework is not necessarily evil thing.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ],
        [
          [
            "Y",
            "promotes",
            "A"
          ],
          [
            "A",
            "is good"
          ]
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ],
        [
          [
            "Y",
            "promotes",
            "A"
          ],
          [
            "A",
            "is good"
          ]
        ]
      ],
      "acknowledges",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ],
      "but nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "homework",
      "Y": "incorrect way to study",
      "A": "they can see the details of answer, or how to solve the questions"
    }
  },
  "Character offset of text spans": {
    "X": [
      52,
      60
    ],
    "Y": [
      526,
      548
    ],
    "A": [
      284,
      349
    ]
  }
}