{
  "PM": "Hello everyone. Today, we are given the motion that homework should be abolished. We defined that homework for primary students should be abolished. We have two points: First, some students tend to dislike studying. Secondly, we have more effective learning ways than homework. Let me explain our first argument. Some students tend to dislike studying but are obliged to do homework and most of students are not enthusiastic about homework. Studying, in fact, is not something to be obliged but rather for satisfying intellectual curiosity. Imagine one-year old babies. They are always looking around, crawling from corner to corner, and touching, even biting, everything unfamiliar to them. In this way, they learn new things and expand their understanding of the world. That's how studying should be. It's not good for students to be obliged to study by their teachers or parents. Being obliged will lead to problems between family. That's one of the reasons some students tend to dislike studying. That is why homework should be abolished. Thank you.",
  "LO": "They said that Some students tend to dislike studying but are obliged to do homework and most of students are not enthusiastic about homework. Studying, in fact, is not something to be obliged but rather for satisfying intellectual curiosity. However, Even if you don't like it, there's something you have to do. If you only do what you like, you will lack or be biased of your knowledge. If the knowledge you have after entering society is lacking or biased, you will be in trouble because of the lack of knowledge. If you are in that state after you enter society, you may not be able to get a job. It's important to do what you don't like to avoid such a possibility and lead a stable life.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            [
              "X",
              "promotes",
              "Y"
            ],
            [
              "Y",
              "is good"
            ]
          ],
          [
            "given rationale/condition",
            "A"
          ]
        ],
        "contradicts",
        [
          [
            "X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ]
      ],
      "nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "homework",
      "Y": "be obliged to study by their teachers or parents",
      "A": "If you only do what you like, you will lack or be biased of your knowledge"
    }
  },
  "Character offset of text spans": {
    "X": [
      52,
      60
    ],
    "Y": [
      833,
      881
    ],
    "A": [
      313,
      387
    ]
  }
}