{
  "PM": "Hello everyone. Today's topic is \"Homework should be abolished\". We have two points: The first point is \"free time\" and the second point is \"decrease burden on teachers\". I will explain the first point of \"free time\". We believe that if homework were to be abolished, we could have more free time. As a result, we could do more of what we really wanted like club activities, hobbies, or playing with friends. In my case, I go to tennis club after class until 5:00 pm and then I go to cram school until 8:00 pm. After this full day, I arrive at my home around 8:40 pm to eat dinner and take a shower. At nearly 10:00 pm I start my homework. I have a lot of homework. As a result, I go to bed late at night at nearly 1:00 am in the morning and I don't have the opportunity to sleep for a long period of time. It is not healthy. Therefore, homework should be abolished. Thank you.",
  "LO": "They said that in order to let students have more free time and reduce the burden of teachers, homework should be abolished. However, after the abolition of homework, students can't get a good review of the knowledge they learn in school, and for students who don't have the habit of reviewing after class, the abolition of homework is a very bad thing for them. This has no good effect on their entrance examination in the future, and it is OK to reduce homework properly, but abolishing homework can not be said to lighten the burden on teachers.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "no X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          "no X",
          "promotes",
          "A"
        ],
        [
          "A",
          "is bad"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "no X",
            "promotes",
            "A"
          ],
          [
            "A",
            "is bad"
          ]
        ],
        "is more important/severe/has greater weight than",
        [
          [
            "no X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ]
      ],
      "nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "Homework",
      "Y": "free time",
      "A": "students can't get a good review of the knowledge they learn in school"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      42
    ],
    "Y": [
      206,
      215
    ],
    "A": [
      167,
      237
    ]
  }
}