{
  "PM": "Hello everyone. Today's topic is \"Homework should be abolished\". We have two points: The first point is \"free time\" and the second point is \"decrease burden on teachers\". I will explain the first point of \"free time\". We believe that if homework were to be abolished, we could have more free time. As a result, we could do more of what we really wanted like club activities, hobbies, or playing with friends. In my case, I go to tennis club after class until 5:00 pm and then I go to cram school until 8:00 pm. After this full day, I arrive at my home around 8:40 pm to eat dinner and take a shower. At nearly 10:00 pm I start my homework. I have a lot of homework. As a result, I go to bed late at night at nearly 1:00 am in the morning and I don't have the opportunity to sleep for a long period of time. It is not healthy. Therefore, homework should be abolished. Thank you.",
  "LO": "They said that if we don't have homework, we have more free time and more healthy day. And teachers' burden will be decreased. However, a number of people who don't study at all will increase. People are forgetful, so not doing homework leads to insufficient fixing of class contents of the day. Thus during a week immediately before a semester test people who don't do class reviews will be more busy and then, they will fail in the examination for lack of preparation. To decrease a number of people who repeat years, homework is necessary.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "no X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          "no X",
          "promotes",
          "A"
        ],
        [
          "A",
          "is bad"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "no X",
            "promotes",
            "A"
          ],
          [
            "A",
            "is bad"
          ]
        ],
        "is more important/severe/has greater weight than",
        [
          [
            "no X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ]
      ],
      "nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "Homework",
      "Y": "free time",
      "A": "a number of people who repeat years"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      42
    ],
    "Y": [
      34,
      43
    ],
    "A": [
      483,
      518
    ]
  }
}