{
  "PM": "Hello everyone. Today's topic is \"Homework should be abolished\". I am going to make two arguments: First, forcing students to do homework will make them passive in character, rather than active. Secondly, abolishing assignments can reduce teachers' workloads. Let me start with the first argument. Some people may think that students should be given homework so that they can learn what to do. However, this is harmful to students because a school is not a place where students only learn to study. It is also where they learn how to live and manage their own lives. Once they graduate from school and start a career, they no longer have a \"teacher\" who will always take care of them and manage what they need to do. Students will have to think about what they need to do by themselves. If students are always given homework, they will always be waiting for instructions and guidelines from teachers and cannot think about what they need to do by themselves. In order to avoid this, homework should be abolished so that students can study on their own initiative. Therefore, for these reasons, homework should be abolished. Thank you.",
  "LO": "They said that abolishing homework can encourage them to learn how to live and manage their own lives. However, it's not always the case. That's because parents will manage them instead of school. Generally speaking parents tend to worry about academic ability of their children. They hope future success of them and know that it is to some extent important factor for their future. That's why it is obvious that they will worry about lack of studying time of them because of abolishing homework. And it is also obvious that they will try to take the role of homework instead. That's the reason why they are likely to impose some study task or send them cram school. Hence we say even if homework were abolished, management skill is less likely to be improved.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "no X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "no X",
            "doesn't promote",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "no X",
            "doesn't promote",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ],
      "nullify",
      [
        [
          "no X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "Text spans": {
      "X": "Homework",
      "Y": "learn how to live and manage their own lives",
      "A": "parents will manage them instead of school"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      42
    ],
    "Y": [
      521,
      565
    ],
    "A": [
      153,
      195
    ]
  }
}