{
  "PM": "Hello everyone. Today's topic is \"Homework should be abolished\". I am going to make two arguments: First, forcing students to do homework will make them passive in character, rather than active. Secondly, abolishing assignments can reduce teachers' workloads. Let me start with the first argument. Some people may think that students should be given homework so that they can learn what to do. However, this is harmful to students because a school is not a place where students only learn to study. It is also where they learn how to live and manage their own lives. Once they graduate from school and start a career, they no longer have a \"teacher\" who will always take care of them and manage what they need to do. Students will have to think about what they need to do by themselves. If students are always given homework, they will always be waiting for instructions and guidelines from teachers and cannot think about what they need to do by themselves. In order to avoid this, homework should be abolished so that students can study on their own initiative. Therefore, for these reasons, homework should be abolished. Thank you.",
  "LO": "They said that once they graduate from school and start a career, they no longer have a \"teacher\" who will always take care of them and manage what they need to do. . However, There are also \"teachers\" who are seniors or bosses when they enter society. It's not important that the job of a teacher exists. It is important to have someone who teaches you things you don't understand, someone who teaches you the necessary knowledge, and even if you go out into society, there are \"teachers\" such as the company's educational system. Therefore, as the government says, there will be no teachers who will take care of you after you start work, so the logic of abolishing homework so that you can study independently is not valid.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            [
              "X",
              "promotes",
              "Y"
            ],
            [
              "Y",
              "is good"
            ]
          ],
          [
            "given rationale/condition",
            "A"
          ]
        ],
        "contradicts",
        [
          [
            "X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ]
      ],
      "nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "Homework",
      "Y": "have a “teacher” who will always take care of them and manage what they need to do",
      "A": "It is important to have someone who teaches you things you don't understand, someone who teaches you the necessary knowledge, and even if you go out into society, there are \"teachers\" such as the company's educational system"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      42
    ],
    "Y": [
      34,
      116
    ],
    "A": [
      306,
      530
    ]
  }
}