{
  "PM": "Today's motion is \"We should abolish the death penalty.\" We strongly believe that we should put an end to this brutal practice and achieve a truly just society. Government has the responsibility because they made the society that created the criminals. Let me define today's motion. \"To abolish\" means to stop the implementation of the practice of the death penalty and instead replace it with a life in prison with the possibility of parole. \"Death penalty\" refers to the punishment currently applied to offenders of serious crimes, through which the criminal gets their life terminated by various methods including hanging, lethal injection, and electrocution. Now, let me explain our points. We have two points to make today. The first point is \"Brutalization of the society\" The second point is \"Restorative justice as an ideal form of justice.\" Let me explain the first point, \"Brutalization of the society.\" Evidently, modern society is becoming more and more brutal; parents killing their own children without any reasons; a son killing his own aging father; a desperate individual killing random people on the street. We are constantly exposed to those kinds of news on various media including television, the Internet, and newspapers. In a sense, they are reflections of how brutal our society has become, and at the same time, they are causing the brutalization itself. We believe that the death penalty is causing the brutalization of modern society for three reasons. Firstly, the state practicing the death penalty as a form of punishment validates the notion that the taking of someone's life is an option, or a valid choice. Human life is more precious than anything else, and no one, including a nation state, should have the power to take it away. The second reason is prosecution by mistake. Actually, there are many cases of false charges like the Menda case. It could be an innocent person at the wrong place at the wrong time. A wrongful conviction, especially when it comes to the death sentence, can never be justified. Data might imply that it's only one-in-a-thousand occurrence; however, that one-in-a-thousand is a huge deal because we are talking about someone's LIFE. The third reason is the intentional abuse of the system. There was a series of random killings committed by a man in Hokkaido in July 2016. Four people were killed as a result, and his motivation was to \"put an end to his own life,\" according to a news report. If a form of punishment becomes a motivation to commit a crime, it no longer functions as a punishment. If the heaviest punishment was a sentence to life in prison, then he wouldn't have chosen to kill those four precious lives. Therefore, the death penalty should be abolished. Thank you.",
  "LO": "They said that the death penalty is wrong because all human life is precious. However, a fundamental purpose of the death penalty is to prevent the loss of human life. It primarily accomplishes this by serving as a deterrent, since the threat of death is thought to be more abhorrent than the threat of life behind bars. The death penalty also eliminates the possibility of an escaped or paroled prisoner killing again once he is back on the streets. More important than ending the life of the killer so he can never hurt anyone again, capital punishment sends a message that taking an innocent life will not be tolerated by a civilized society. Thus, this ultimate punishment serves as an antidote to brutality and reinforces the importance of protecting innocent lives rather than coddling the guilty.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "suppresses",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            [
              "X",
              "suppresses",
              "Y"
            ],
            [
              "Y",
              "is bad"
            ]
          ],
          [
            "given rationale/condition",
            "A"
          ]
        ],
        "contradicts",
        [
          [
            "X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ]
      ],
      "nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "death penalty",
      "Y": "brutalization of modern society",
      "A": "capital punishment sends a message that taking an innocent life will not be tolerated by a civilized society"
    }
  },
  "Character offset of text spans": {
    "X": [
      41,
      54
    ],
    "Y": [
      1429,
      1460
    ],
    "A": [
      536,
      644
    ]
  }
}