{
  "PM": "Hello everyone. Today's topic is \"Death penalty should be abolished\". I am going to make two arguments. First, misjudgment in the death penalty is very dangerous. Second, the death penalty is a cruel penalty. Let me start with the first argument. Humans make mistakes. This is the nature of a human and we cannot deny it completely. Of course, technology has been developed such as DNA testing, surveillance camera, and so on. However, still there is still a possibility of misjudgment. If misjudgment happens when the court sentences the suspected criminal the death penalty, it will be irreparable. When we deprive the life of a suspected criminal, they will never be able to live again. It's very terrible. Imagine the case where your family member is mistakenly arrested by the police and unfortunately suspected to be sentenced to the death penalty. Would you be able to endure this situation? The answer is definitely \"No\". Therefore, at least, by abolishing death penalty, we can prevent the situation of ending the life of innocent people. At least, we will have more time to investigate the truth when the innocent in jail are suspected of a serious crime. Then, there will be a greater chance that the innocent, suspected person can be saved in the future from losing their life. It's much safer society. Remember, even if we carefully investigate the incident, there is always a risk of mistakes. For these reasons, death penalty should be abolished. Thank you.",
  "LO": "They said that the chance of a mistake in a death sentence case is reason to ban this penalty. However, in reality, death row inmates get plenty of chances to correct any mistakes that may have been made in their case. It's impossible to guarantee that no mistakes will occur in any trial, whether the defendant is charged with shoplifting or mass murder. But death row inmates are granted a special right that ensures they get a second chance -- the right to an appeal. The publicity surrounding capital punishment cases -- due to anti-death penalty sentiment, media sensationalism of horrific crimes and other factors -- also ensures scrutiny of the investigation, trial and conviction in the case. Moreover, because of the politicization of the death penalty, numerous organizations have made it their mission to try to overturn convictions, particularly if there is even the slightest tinge of suspicion of a mistake in the original case.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "doesn't promote",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "X",
            "doesn't promote",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ],
      "nullify",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "Text spans": {
      "X": "Death penalty",
      "Y": "the situation of ending the life of innocent people",
      "A": "death row inmates get plenty of chances to correct any mistakes that may have been made in their case"
    }
  },
  "Character offset of text spans": {
    "X": [
      34,
      47
    ],
    "Y": [
      995,
      1046
    ],
    "A": [
      116,
      217
    ]
  }
}