{
  "PM": "Hello everyone. Today, we are given the motion that the death penalty should be abolished. We strongly support this motion. Before explaining our arguments, let me define the motion. We are going to abolish the death penalty all over the world and introduce a life-imprisonment system. It means that criminals stay in jail forever. We have two points. First point is \"Rehabilitation\". The second point is \"World's trend\". So, let me explain our first argument. Our claim is that the death penalty deprives the chance of rehabilitation of the criminals. Our reasoning is as follows. In the case of a serious crime such as murder, especially random killing of many people, a heavy punishment should be sentenced. The death penalty might be an option, but it just ends the life of a criminal and solves nothing. The criminal has no chance to reflect on what they have done. They need to reflect on their wrong-doing every day. They should spend their lives reflecting on it. Life imprisonment system is, in a sense, a very severe punishment. Criminals are restricted of their freedom all day. They need to continue to apologize for the rest of their life while thinking about their victims. Moreover, there is a perspective that the society creates the criminals. For example, imagine a case that a student who was always been bullied and notified others such as teachers and the community, but they did nothing to help. The student was ignored by everyone. In that case, it is understandable that the student attacks others due to their anger at a society where no one helps. Like this, a society also has a responsibility for a criminal, and for this reason, it is a government task to set the opportunity of rehabilitation in the life imprisonment system. The death penalty is an irresponsible act by the nation. For all these reasons, we beg to propose. Thank you.",
  "LO": "They said that prisoners deserve to be rehabilitated, so the death penalty is wrong. However, rehabilitation, like criminal behavior, is largely a matter of choice. Unless someone wants to be rehabilitated, no amount of spiritual counseling, vocational training and therapy is going to change that person. In the case of criminals found guilty of capital crimes that carry the death penalty -- including mass murder and terrorism -- the possibility of real rehabilitation is even more remote. Yes, we can increase participation in rehabilitation programs by offering enticements such as extra TV time or family visits, but this strategy is a bit like bribing a toddler with a treat: the results are likely to be short-term at best, and the effect tends to disappear when the incentive is removed. Moreover, we need to recognize that criminals learn to manipulate the system, so can we really trust a mass murderer who claims to have repented and seen the light?",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "suppresses",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          [
            "X",
            "is more important/severe/has greater weight than",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "X",
            "is more important/severe/has greater weight than",
            "Y"
          ],
          [
            "Y",
            "is good"
          ]
        ],
        [
          "given rationale/condition",
          "A"
        ]
      ],
      "acknowledges",
      [
        [
          "X",
          "suppresses",
          "Y"
        ],
        [
          "Y",
          "is good"
        ]
      ],
      "but nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "death penalty",
      "Y": "the chance of rehabilitation of the criminals",
      "A": "Unless someone wants to be rehabilitated, no amount of spiritual counseling, vocational training and therapy is going to change that person"
    }
  },
  "Character offset of text spans": {
    "X": [
      56,
      69
    ],
    "Y": [
      506,
      551
    ],
    "A": [
      165,
      304
    ]
  }
}