{
  "PM": "Hello, everyone. Today's topic is \"Death penalty should be abolished\". We define that the death penalty should be abolished and instead of the death penalty, we propose that the suspected are sentence to life in. We have two points. The first point is \"Executioner's suffering\". The second point is \"Cruelty of death penalty\". I will explain the first point. In present situations, a person who executes the death penalty for a criminal whose death penalty has been confirmed by a trial suffers a lot. Some methods of the death penalty include hanging and using gas chambers. Let me illustrate the case of hanging in Japan. A prisoner does not know when they will be executed until the day of execution. At the day of execution, they first enter the teacher's room and write a farewell letter. Then, they go to the antechamber for execution and are separated from the execution room by a curtain. The convict on death row is blindfolded and handcuffed, and a curtain is closed to the execution room. Finally, they go to the execution room. A rope is hung around their neck and they stand on a tread plate marked in the center of the room. Then, multiple prison officers push the button to open and close the tread, and the convict on death row falls. Those executioners feel strong stress. They don't know which button is actually connected to the input of the tread. They feel that they are responsible themselves for killing the suspect on death row by their own hands. Executers' stress is extremely overwhelming. That's why the death penalty should be abolished. Thank you.",
  "LO": "They said that death penalty should be abolished primarily due to executioner's suffering and cruelty of the death penalty. However, death penalty should not be abolished as it is an effective deterrent against heinous crimes. Issues like executioner's stress can be mitigated by using more humane means of execution like that be lethal injection ro by using robots and other automated tools to carry out the execution. The death penalty should exist however unpleasant the task would be as it is the only way by which we can create an atmosphere of fear in budding criminals who exist in all strata of society.",
  "Pattern": {
    "PM": [
      [
        "X",
        "is negative"
      ],
      "support",
      [
        [
          "X",
          "promotes",
          "Y"
        ],
        [
          "Y",
          "is bad"
        ]
      ]
    ],
    "LO": [
      [
        "X",
        "is not negative"
      ],
      "support",
      [
        [
          "X",
          "promotes",
          "A"
        ],
        [
          "A",
          "is good"
        ]
      ]
    ],
    "Attack": [
      [
        [
          [
            "X",
            "promotes",
            "A"
          ],
          [
            "A",
            "is good"
          ]
        ],
        "is more important/severe/has greater weight than",
        [
          [
            "X",
            "promotes",
            "Y"
          ],
          [
            "Y",
            "is bad"
          ]
        ]
      ],
      "nullify",
      [
        "X",
        "is negative"
      ]
    ],
    "Text spans": {
      "X": "Death penalty",
      "Y": "Executioner's suffering",
      "A": "an effective deterrent against heinous crimes"
    }
  },
  "Character offset of text spans": {
    "X": [
      35,
      48
    ],
    "Y": [
      253,
      276
    ],
    "A": [
      180,
      225
    ]
  }
}